Repository: mauriolmedo/metatag_ai_generate
Catalog: translations/metatag_ai_generate.*.po
Languages: de, es, fr, ja

source: Enable AI meta tag generation
de: KI-Meta-Tag-Generierung aktivieren
es: Activar generación de metaetiquetas con IA
fr: Activer la génération de méta-tags par IA
ja: AIメタタグ生成を有効化

source: When enabled, AI-powered meta description generation is available for content.
de: Wenn aktiviert, ist die KI-gestützte Meta-Beschreibungs-Generierung für Inhalte verfügbar.
es: Cuando está activada, la generación de metadescripciones con IA está disponible para el contenido.
fr: Lorsqu'activée, la génération de méta-descriptions par IA est disponible pour le contenu.
ja: 有効にすると、コンテンツにAI駆動のメタディスクリプション生成が利用可能になります。

source: AI Provider
de: KI-Anbieter
es: Proveedor de IA
fr: Fournisseur IA
ja: AIプロバイダー

source: Select the AI provider and model to use for generating meta descriptions. Providers must be configured with API keys before they appear here.
de: Wählen Sie den KI-Anbieter und das Modell zur Generierung von Meta-Beschreibungen aus. Anbieter müssen mit API-Schlüsseln konfiguriert werden, bevor sie hier erscheinen.
es: Seleccione el proveedor y modelo de IA para generar metadescripciones. Los proveedores deben configurarse con claves API antes de aparecer aquí.
fr: Sélectionnez le fournisseur et le modèle IA à utiliser pour générer les méta-descriptions. Les fournisseurs doivent être configurés avec des clés API avant d'apparaître ici.
ja: メタディスクリプション生成に使用するAIプロバイダーとモデルを選択してください。プロバイダーはここに表示される前にAPIキーで設定する必要があります。

source: No AI providers are configured. Please <a href=":url">configure an AI provider</a> with a valid API key first.
de: Es sind keine KI-Anbieter konfiguriert. Bitte <a href=":url">konfigurieren Sie einen KI-Anbieter</a> mit einem gültigen API-Schlüssel zuerst.
es: No hay proveedores de IA configurados. Por favor, <a href=":url">configure un proveedor de IA</a> con una clave API válida primero.
fr: Aucun fournisseur IA n'est configuré. Veuillez <a href=":url">configurer un fournisseur IA</a> avec une clé API valide d'abord.
ja: AIプロバイダーが設定されていません。まず有効なAPIキーで<a href=":url">AIプロバイダーを設定</a>してください。

source: AI Persona
de: KI-Persona
es: Persona de IA
fr: Persona IA
ja: AIペルソナ

source: Describe the persona the AI should adopt when generating meta descriptions. Example: "a professional content writer specializing in SEO for e-commerce"
de: Beschreiben Sie die Persona, die die KI beim Generieren von Meta-Beschreibungen annehmen soll. Beispiel: "ein professioneller Content-Autor mit Spezialisierung auf SEO für E-Commerce"
es: Describa la persona que la IA debe adoptar al generar metadescripciones. Ejemplo: "un redactor de contenido profesional especializado en SEO para comercio electrónico"
fr: Décrivez le persona que l'IA doit adopter lors de la génération des méta-descriptions. Exemple : "un rédacteur de contenu professionnel spécialisé en SEO pour l'e-commerce"
ja: メタディスクリプション生成時にAIが採用すべきペルソナを記述してください。例：「eコマースのSEOに特化したプロのコンテンツライター」

source: Enabled Content Types
de: Aktivierte Inhaltstypen
es: Tipos de contenido habilitados
fr: Types de contenu activés
ja: 有効なコンテンツタイプ

source: Select which content types should have AI meta tag generation enabled. Leave all unchecked to enable for all content types.
de: Wählen Sie aus, für welche Inhaltstypen die KI-Meta-Tag-Generierung aktiviert werden soll. Lassen Sie alle unmarkiert, um alle Inhaltstypen zu aktivieren.
es: Seleccione qué tipos de contenido deben tener habilitada la generación de metaetiquetas con IA. Deje todo sin marcar para habilitar todos los tipos de contenido.
fr: Sélectionnez les types de contenu pour lesquels la génération de méta-tags par IA doit être activée. Laissez tout décoché pour activer tous les types de contenu.
ja: AIメタタグ生成を有効にするコンテンツタイプを選択してください。すべてのコンテンツタイプで有効にする場合は、すべてチェックを外してください。

source: Cannot generate meta description for unsaved content. Please save the node first.
de: Kann keine Meta-Beschreibung für ungespeicherte Inhalte generieren. Bitte speichern Sie den Inhalt zuerst.
es: No se puede generar la metadescripción para contenido no guardado. Por favor, guarde el contenido primero.
fr: Impossible de générer la méta-description pour un contenu non enregistré. Veuillez enregistrer le contenu d'abord.
ja: 未保存のコンテンツに対してメタディスクリプションを生成できません。まずコンテンツを保存してください。

source: Generation Error
de: Generierungsfehler
es: Error de generación
fr: Erreur de génération
ja: 生成エラー

source: Error loading node: @error
de: Fehler beim Laden des Inhalts: @error
es: Error al cargar el contenido: @error
fr: Erreur lors du chargement du contenu : @error
ja: コンテンツの読み込みエラー：@error

source: AI Generated Description
de: KI-generierte Beschreibung
es: Descripción generada con IA
fr: Description générée par IA
ja: AI生成ディスクリプション

source: Generated meta description
de: Generierte Meta-Beschreibung
es: Metadescripción generada
fr: Méta-description générée
ja: 生成されたメタディスクリプション

source: 0 characters
de: 0 Zeichen
es: 0 caracteres
fr: 0 caractères
ja: 0文字

source: Optimal length: 155-160 characters (visible on all devices). Up to 200 characters accepted.
de: Optimale Länge: 155-160 Zeichen (auf allen Geräten sichtbar). Bis zu 200 Zeichen akzeptiert.
es: Longitud óptima: 155-160 caracteres (visible en todos los dispositivos). Hasta 200 caracteres aceptados.
fr: Longueur optimale : 155-160 caractères (visible sur tous les appareils). Jusqu'à 200 caractères acceptés.
ja: 最適な長さ：155-160文字（すべてのデバイスで表示）。最大200文字まで受け入れられます。

source: Actions
de: Aktionen
es: Acciones
ja: アクション

source: Approve and use this description
de: Diese Beschreibung genehmigen und verwenden
es: Aprobar y usar esta descripción
fr: Approuver et utiliser cette description
ja: このディスクリプションを承認して使用

source: Approve
de: Genehmigen
es: Aprobar
fr: Approuver
ja: 承認

source: Generate a new description
de: Eine neue Beschreibung generieren
es: Generar una nueva descripción
fr: Générer une nouvelle description
ja: 新しいディスクリプションを生成

source: Regenerate
de: Neu generieren
es: Regenerar
fr: Régénérer
ja: 再生成

source: Reject and close dialog
de: Ablehnen und Dialog schließen
es: Rechazar y cerrar diálogo
fr: Rejeter et fermer la boîte de dialogue
ja: 拒否してダイアログを閉じる

source: Reject
de: Ablehnen
es: Rechazar
fr: Rejeter
ja: 拒否

source: Generate with AI
de: Mit KI generieren
es: Generar con IA
fr: Générer avec l'IA
ja: AIで生成

source: Generating...
de: Generierung läuft...
es: Generando...
fr: Génération en cours...
ja: 生成中...

source: AI meta description generation is disabled.
de: Die KI-Meta-Beschreibungs-Generierung ist deaktiviert.
es: La generación de metadescripciones con IA está desactivada.
fr: La génération de méta-descriptions par IA est désactivée.
ja: AIメタディスクリプション生成が無効になっています。

source: No AI provider configured for chat.
de: Kein KI-Anbieter für Chat konfiguriert.
es: No hay proveedor de IA configurado para chat.
fr: Aucun fournisseur IA configuré pour le chat.
ja: チャット用のAIプロバイダーが設定されていません。

source: No default AI provider configured.
de: Kein Standard-KI-Anbieter konfiguriert.
es: No hay proveedor de IA predeterminado configurado.
fr: Aucun fournisseur IA par défaut configuré.
ja: デフォルトのAIプロバイダーが設定されていません。

source: Configured AI provider is not available.
de: Der konfigurierte KI-Anbieter ist nicht verfügbar.
es: El proveedor de IA configurado no está disponible.
fr: Le fournisseur IA configuré n'est pas disponible.
ja: 設定されたAIプロバイダーが利用できません。

source: No content available to generate description from.
de: Kein Inhalt verfügbar, um eine Beschreibung zu generieren.
es: No hay contenido disponible para generar una descripción.
fr: Aucun contenu disponible pour générer une description.
ja: ディスクリプション生成に利用できるコンテンツがありません。

source: AI returned an empty response.
de: Die KI hat eine leere Antwort zurückgegeben.
es: La IA devolvió una respuesta vacía.
fr: L'IA a retourné une réponse vide.
ja: AIが空の応答を返しました。

source: AI request failed:
de: KI-Anfrage fehlgeschlagen:
es: La solicitud de IA falló:
fr: La requête IA a échoué :
ja: AIリクエストが失敗しました：

source: An unexpected error occurred.
de: Ein unerwarteter Fehler ist aufgetreten.
es: Ocurrió un error inesperado.
fr: Une erreur inattendue s'est produite.
ja: 予期しないエラーが発生しました。

source: Metatag AI Generate
de: Metatag KI-Generierung
es: Generación de metaetiquetas IA
fr: Génération de méta-tags IA
ja: メタタグAI生成

source: Configure AI-powered meta description generation.
de: Konfigurieren Sie die KI-gestützte Meta-Beschreibungs-Generierung.
es: Configurar la generación de metadescripciones con IA.
fr: Configurer la génération de méta-descriptions par IA.
ja: AI駆動のメタディスクリプション生成を設定します。

source: Generate AI-powered meta descriptions using the AI module framework.
de: Generiert KI-gestützte Meta-Beschreibungen mit dem AI-Modul-Framework.
es: Genera metadescripciones con IA utilizando el framework del módulo AI.
fr: Génère des méta-descriptions alimentées par IA en utilisant le framework du module AI.
ja: AIモジュールフレームワークを使用してAI駆動のメタディスクリプションを生成します。
